of-run/canal/canal2D/canal2DsRAS_owc1800w130_FFt-z10/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch column
runApplication setFields
runApplication $application &

pyFoamPlotWatcher.py log.interFoam

#------------------------------------------------------------------------------
