of-run/canal/canal2D/canal2DsRAS_owc1800w130_FFt-z10/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0) //0
    (44 0 0)  //1
    (0 7.5 0) //2  
    (44 7.5 0) //3
    (169.3 7.5 0) //4
    (172.4 7.5 0) //5
    (175.4 7.5 0) //6
    (177.9 7.5 0) //7
    (0 32.5 0) //8
    (44 32.5 0) //9
    (169.3 32.5 0) //10    
    (172.4 32.5 0) //11
    (175.4 32.5 0)  //12
    (177.9 32.5 0) //13  
	(172.4 60 0) //14
	(175.4 60 0) //15
	(0 0 10) //16
    (44 0 10) //17 
    (0 7.5 10) //18  
    (44 7.5 10) //19
    (169.3 7.5 10) //20
    (172.4 7.5 10) //21
    (175.4 7.5 10) //22
    (177.9 7.5 10) //23
    (0 32.5 10) //24
    (44 32.5 10) //25
    (169.3 32.5 10) //26    
    (172.4 32.5 10) //27
    (175.4 32.5 10)  //28
    (177.9 32.5 10) //29
	(172.4 60 10) //30
	(175.4 60 10) //31	
	
);

blocks
(
    hex (0 1 3 2 16 17 19 18) (88 15 1) simpleGrading (1 1 1)
    hex (2 3 9 8 18 19 25 24) (88 50 1) simpleGrading (1 1 1)
    hex (3 4 10 9 19 20 26 25) (251 50 1) simpleGrading (1 1 1)
    hex (4 5 11 10 20 21 27 26) (6 50 1) simpleGrading (1 1 1)
    hex (5 6 12 11 21 22 28 27) (6 50 1) simpleGrading (1 1 1)
    hex (6 7 13 12 22 23 29 28) (5 50 1) simpleGrading (1 1 1)
hex (11 12 15 14 27 28 31 30) (6 55 1) simpleGrading (1 1 1)
                                                                                                                                                                                                                                                                                             
);

edges
(
);

boundary
(
	leftWall
    {
        type wall;
        faces
        (
            (0 16 18 2)
            (2 18 24 8)
			(11 27 30 14)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (13 29 23 7)
			(15 31 28 12)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 3 19 17)
            (3 4 20 19)
	    	(4 5 21 20)
            (5 6 22 21)
	    	(6 7 23 22)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 24 25 9)
            (9 25 26 10)
			
        );
    }
    outflow
    {
        type patch;
        faces
        (
            (14 30 31 15)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (10 26 27 11)
            (12 28 29 13)
        );
    }
    column
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
