of-run/canal/canal2D/canal2DsRAS_owc1800w130_FFt-z10/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (1.739 0.0775 0.005)
    (1.739 0.0925 0.005) 	
    (1.739 0.1125 0.005)
    (1.739 0.1325 0.005)
    (1.739 0.1525 0.005)
    (1.739 0.1725 0.005)
    (1.739 0.1925 0.005)
    (1.739 0.2125 0.005)
    (1.739 0.2325 0.005)
    (1.739 0.2525 0.005)
    (1.739 0.2725 0.005)
    (1.739 0.2925 0.005)
    (1.739 0.3125 0.005)
    



);

// ************************************************************************* //
